load-test/polling-test.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 15
      arrivalRate: 50
    - duration: 20
      arrivalRate: 200
    - duration: 30
      arrivalRate: 1000
    - duration: 15
      arrivalRate: 200
scenarios:
  - flow:
      - get:
          url: "/location/cur"
      - think: 3